{
  "file_path": "news/AHaber/20241216_Türkiye - İsrail Çatışması Yaşanır Mı？ İsrail'in Hedefi Başkent Şam Mı？ ｜ A Haber.tr.txt",
  "processing_timestamp": "2025-07-22T15:45:45.505825",
  "original_word_count": 17975,
  "filtered_word_count": 157,
  "retention_ratio": 0.008734353268428374,
  "structure_sections": [
    {
      "type": "1. **INTRO**",
      "start_pos": 0,
      "start_sentence": "İyi geceler değerli izleyenler A Haber ve A Haber radyo ortak yayınında gece ajansına Hoş geldiniz",
      "description": "\"İyi geceler değerli izleyenler A Haber ve A Haber radyo ortak yayınında gece ajansına Hoş geldiniz\" - This section serves as the opening of the broadcast, welcoming viewers and introducing the program.",
      "end_pos": 484
    },
    {
      "type": "2. **NEWS**",
      "start_pos": 484,
      "start_sentence": "Beşar Esat rejimi yıkıldı Suriye'de çok sıcak gelişmeler yaşanıyor",
      "description": "\"Beşar Esat rejimi yıkıldı Suriye'de çok sıcak gelişmeler yaşanıyor\" - This section contains the main news content, discussing the current situation in Syria, including developments related to the Assad regime and Israeli actions in the region.",
      "end_pos": 484
    },
    {
      "type": "3. **TRANSITION**",
      "start_pos": 484,
      "start_sentence": "Ama önce sıcak bölgeye gidelim",
      "description": "\"Ama önce sıcak bölgeye gidelim\" - This brief transition indicates a shift from the introduction to the specific news report from the field, signaling a change in focus to the on-ground situation.",
      "end_pos": 771
    },
    {
      "type": "4. **NEWS**",
      "start_pos": 771,
      "start_sentence": "Evet da bir taraftan Hayat aslında normale dönmüş durumda iyiden iyiye zira birçok işletme artık kepenklerini açtı",
      "description": "\"Evet da bir taraftan Hayat aslında normale dönmüş durumda iyiden iyiye zira birçok işletme artık kepenklerini açtı\" - This continues the news segment, providing detailed information about the situation in Syria, including the return to normalcy in some areas and ongoing conflicts.",
      "end_pos": 962
    },
    {
      "type": "5. **NEWS**",
      "start_pos": 962,
      "start_sentence": "Zira Suriye'nin güneyinde İsrail golan tepelerini aşıp O noktada farklı köylere girerek köyler köyleri de işgal ediyor",
      "description": "\"Zira Suriye'nin güneyinde İsrail golan tepelerini aşıp O noktada farklı köylere girerek köyler köyleri de işgal ediyor\" - This part further elaborates on the Israeli military actions and their impact on local populations, continuing the news narrative.",
      "end_pos": 122564
    }
  ],
  "news_segments_count": 12,
  "economic_segments_count": 1,
  "economic_segments": [
    {
      "segment_id": "962_7",
      "method": "simple_sentence",
      "confidence": 0.5,
      "original_length": 157,
      "filtered_length": 157,
      "retention_ratio": 1.0,
      "section_description": "\"Zira Suriye'nin güneyinde İsrail golan tepelerini aşıp O noktada farklı köylere girerek köyler köyleri de işgal ediyor\" - This part further elaborates on the Israeli military actions and their impact on local populations, continuing the news narrative."
    }
  ],
  "pipeline_stats": {
    "structure_analysis_success": true,
    "semantic_segmentation_success": true,
    "economic_filtering_success": true
  }
}